## Group : Alexandre Fernandes, Jorge Beleza da Silva, Mateus Abdallah Fonseca

## Import libraries

In [51]:
# Importing python libraries
import numpy as np
import pandas as pd

## Reading the dataset, get some informations and handling missing rows

In [52]:
# Load the dataset and get a peak 
df = pd.read_csv('unclean_data.csv')
df.head()

,model,year,price,transmission,mileage,fuel type,engine size,mileage2,fuel type2,engine size2,reference
0,C Class,2020.0,"£30,495",Automatic,NaN,Diesel,2,"1,200",NaN,NaN,/ad/25017331
1,C Class,2020.0,"£29,989",Automatic,NaN,Petrol,1.5,"1,000",NaN,NaN,/ad/25043746
2,C Class,2020.0,"£37,899",Automatic,NaN,Diesel,2,500,NaN,NaN,/ad/25142894
3,C Class,2019.0,"£30,399",Automatic,NaN,Diesel,2,"5,000",NaN,NaN,/ad/24942816
4,C Class,2019.0,"£29,899",Automatic,NaN,Diesel,2,"4,500",NaN,NaN,/ad/24913660

In [53]:
# Summary of datatypes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4006 entries, 0 to 4005
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   model         3907 non-null   object
 1   year          3904 non-null   float64
 2   price         3907 non-null   object
 3   transmission  3907 non-null   object
 4   mileage       3808 non-null   object
 5   fuel type     1329 non-null   object
 6   engine size   3842 non-null   object
 7   mileage2      3890 non-null   object
 8   fuel type2    3808 non-null   object
 9   engine size2  3808 non-null   object
 10  reference     3907 non-null   object
dtypes: float64(1), object(10)
memory usage: 344.4+ KB

In [54]:
# Get the sum of all null values in each column
df.isnull().sum()

model             99
year             102
price             99
transmission      99
mileage          198
fuel type       2677
engine size      164
mileage2         116
fuel type2       198
engine size2     198
reference         99
dtype: int64

In [55]:
# Dropping null values and reset the index
df.dropna(inplace=True)
df.reset_index(drop=True, inplace=True)
df.head(10)

,model,year,price,transmission,mileage,fuel type,engine size,mileage2,fuel type2,engine size2,reference
0,C Class,2013.0,"£9,995",Automatic,"44,900",29,£160,46.3,Petrol,1.6,/ad/25128085
1,C Class,2012.0,"£6,995",Automatic,"88,200",34,£125,58.9,Diesel,2.1,/ad/23763610
2,C Class,2012.0,"£7,495",Automatic,"115,000",37,£145,54.3,Diesel,2.1,/ad/24626603
3,C Class,2011.0,"£8,995",Automatic,"69,250",29,£150,53.3,Diesel,2.1,/ad/25462537
4,C Class,2015.0,"£14,995",Automatic,"49,850",31,£30,62.8,Diesel,2.1,/ad/25479169
5,C Class,2013.0,"£8,595",Automatic,"82,685",32,£30,64.2,Diesel,2143,/ad/25450549
6,C Class,2016.0,"£19,250",Semi-Auto,"32,506",38,£125,60.1,Diesel,2.1,/ad/25405174
7,C Class,2017.0,"£23,500",Semi-Auto,"17,000",33,£145,67.3,Diesel,2.1,/ad/25344580
8,C Class,2014.0,"£17,990",Automatic,"41,011",28,£150,49.6,Petrol,1991,/ad/25456630
9,C Class,2016.0,"£14,477",Automatic,"72,000",25,£30,65.7,Diesel,1.6,/ad/25087114

## Handling the currency symbols and comma format in price column

In [56]:
# Replace the currency character and the comma from price column
df['price'] = df['price'].str.replace('£', ' ')
df['price'] = df['price'].str.replace(',', ' ')
df.head()

,model,year,price,transmission,mileage,fuel type,engine size,mileage2,fuel type2,engine size2,reference
0,C Class,2013.0,9 995,Automatic,"44,900",29,£160,46.3,Petrol,1.6,/ad/25128085
1,C Class,2012.0,6 995,Automatic,"88,200",34,£125,58.9,Diesel,2.1,/ad/23763610
2,C Class,2012.0,7 495,Automatic,"115,000",37,£145,54.3,Diesel,2.1,/ad/24626603
3,C Class,2011.0,8 995,Automatic,"69,250",29,£150,53.3,Diesel,2.1,/ad/25462537
4,C Class,2015.0,14 995,Automatic,"49,850",31,£30,62.8,Diesel,2.1,/ad/25479169

## Handling non-valid column names

In [57]:
# Rename the names of some columns
df.rename(columns={'fuel type':'fuel_type', 'engine size':'engine_size', 
                   'fuel type2':'fuel_type2','engine size2':'engine_size2'}, inplace=True)
df.head()

,model,year,price,transmission,mileage,fuel_type,engine_size,mileage2,fuel_type2,engine_size2,reference
0,C Class,2013.0,9 995,Automatic,"44,900",29,£160,46.3,Petrol,1.6,/ad/25128085
1,C Class,2012.0,6 995,Automatic,"88,200",34,£125,58.9,Diesel,2.1,/ad/23763610
2,C Class,2012.0,7 495,Automatic,"115,000",37,£145,54.3,Diesel,2.1,/ad/24626603
3,C Class,2011.0,8 995,Automatic,"69,250",29,£150,53.3,Diesel,2.1,/ad/25462537
4,C Class,2015.0,14 995,Automatic,"49,850",31,£30,62.8,Diesel,2.1,/ad/25479169